package com.javalec.quiz;
/*
 * 클래스 : MyMath
 *  - 필드 : 없음
 *  - 메소드 
 *    1) getTotal()	: 정수 1개를 인자값으로 받고, 1 부터 그 수까지의 모든 합을 return
 *      e.g. 인자값 : 5 -> 리턴값 : 10
 *           인자값 : 3 -> 리턴값 : 6
 *    2) getGugudan() : 정수 1개를 인자값으로 받고, 해당 단을 String형태로 return 
 *  
 * 메인 클래스 : Quiz02
 * 	메뉴 : 
 *    1. 총합 구하기
 *    2. 구구단 보기
 *    3. 종료하기
 *  - 1번 선택 시 : 정수 1개를 입력 받아 1 ~ 정수까지의 합 출력
 *  - 2번 선택 시 : 정수 1개를 입력 받아 해당 단 출력
 *  - 3번 선택 시 : 프로그램 종료 
 *    (3번을 선택해야 메뉴창 띄우기를 반복 종료함.)
 */
class MyMath {
	
}
public class Quiz02 {

}
