package com.javalec.quiz;
/*
 * Student 클래스 만들기 
 *  필드 : 이름, 국, 영, 수, 평균, 등급
 *  메소드 : 
 *   1. 생성자 
 *   	1) 아무것도 안넣어도 생성될 수 있게 
 *   	2) 이름만 넣고 생성될 수 있게
 *   	3) 이름, 국, 영, 수를 넣고 생성될 수 있게 => 평균, 등급 자동 계산
 *   2. setAvg() - 국,영,수로 평균을 계산하여 평균 필드에 저장
 *   3. setGrade() - 평균 점수로 A,B,C,D,F를 계산하여 등급 필드에 저장
 *   4. printData() - 이름, 평균, 등급을 sysout
 *   5. getData() - 이름, 국, 영, 수, 평균, 등급을 String으로 묶어서 return
 *  ** 참고! 생성자 안에서도 일반 메소드 호출할 수 있음! 
 * 
 *  Quiz01 메인 클래스 
 *   메뉴 : 
 *    1. 3명 학생 정보 입력 
 *    2. 3명 학생 정보 보기
 *    3. 종료하기 
 */
public class Quiz01 {

}


















